RohmSemiconductor/RoKiX-firmware-for-nRF5-SDK/firmware/src/rokix/sensors/kxg08/kxg08_registers.h
// Definition according FSYNC_MODE selection
#define KXG08_FSYNC_CTL_FSYNC_SEL_SEL111 (0x07 << 0)
// Absolute threshold. ASIC compares current output to threshold.
#define KXG08_WAKE_SLEEP_CTL1_TH_MODE_ABSOLUTE_THRESHOLD (0x00 << 5)
// Relative threshold. ASIC compares difference between current output and previous output to threshold.
#define KXG08_WAKE_SLEEP_CTL1_TH_MODE_RELATIVE_THRESHOLD (0x01 << 5)
// Counter is cleared once activity level is outside the threshold.
#define KXG08_WAKE_SLEEP_CTL1_C_MODE_COUNTER_CLEAR (0x00 << 4)
// Counter is decremented by one when activity level is outside the threshold.
#define KXG08_WAKE_SLEEP_CTL1_C_MODE_COUNTER_DECREMENT (0x01 << 4)
// 0.78Hz
#define KXG08_WAKE_SLEEP_CTL1_OWUF_0P781 (0x00 << 0)
// 1.563Hz
#define KXG08_WAKE_SLEEP_CTL1_OWUF_1P563 (0x01 << 0)
// 3.125Hz
#define KXG08_WAKE_SLEEP_CTL1_OWUF_3P125 (0x02 << 0)
// 6.25Hz
#define KXG08_WAKE_SLEEP_CTL1_OWUF_6P25 (0x03 << 0)
// 12.5Hz
#define KXG08_WAKE_SLEEP_CTL1_OWUF_12P5 (0x04 << 0)
// 25Hz
#define KXG08_WAKE_SLEEP_CTL1_OWUF_25 (0x05 << 0)
// 50Hz
#define KXG08_WAKE_SLEEP_CTL1_OWUF_50 (0x06 << 0)
// 100Hz
#define KXG08_WAKE_SLEEP_CTL1_OWUF_100 (0x07 << 0)
// Active high back-to-sleep function enable
#define KXG08_WAKE_SLEEP_CTL2_BTS_EN (0x01 << 7)
// Active high wake-up function enable.
#define KXG08_WAKE_SLEEP_CTL2_WUF_EN (0x01 << 6)
// Forces transition to sleep state.
#define KXG08_WAKE_SLEEP_CTL2_MAN_SLEEP (0x01 << 5)
// Forces transition to wake state.
#define KXG08_WAKE_SLEEP_CTL2_MAN_WAKE (0x01 << 4)
#define KXG08_WAKE_SLEEP_CTL2_OBTS_0P048828 (0x00 << 0)
#define KXG08_WAKE_SLEEP_CTL2_OBTS_0P097656 (0x01 << 0)
#define KXG08_WAKE_SLEEP_CTL2_OBTS_0P19531 (0x02 << 0)
#define KXG08_WAKE_SLEEP_CTL2_OBTS_0P3906 (0x03 << 0)
// 0.78Hz
#define KXG08_WAKE_SLEEP_CTL2_OBTS_0P781 (0x04 << 0)
// 1.563Hz
#define KXG08_WAKE_SLEEP_CTL2_OBTS_1P563 (0x05 << 0)
// 3.125Hz
#define KXG08_WAKE_SLEEP_CTL2_OBTS_3P125 (0x06 << 0)
// 6.25Hz
#define KXG08_WAKE_SLEEP_CTL2_OBTS_6P25 (0x07 << 0)
// 12.5Hz
#define KXG08_WAKE_SLEEP_CTL2_OBTS_12P5 (0x08 << 0)
// 25Hz
#define KXG08_WAKE_SLEEP_CTL2_OBTS_25 (0x09 << 0)
// 50Hz
#define KXG08_WAKE_SLEEP_CTL2_OBTS_50 (0x0A << 0)
// 100Hz
#define KXG08_WAKE_SLEEP_CTL2_OBTS_100 (0x0B << 0)
// 100Hz
#define KXG08_WAKE_SLEEP_CTL2_OBTS_100_2 (0x0C << 0)
// 100Hz
#define KXG08_WAKE_SLEEP_CTL2_OBTS_100_3 (0x0D << 0)
// 100Hz
#define KXG08_WAKE_SLEEP_CTL2_OBTS_100_4 (0x0E << 0)
// 100Hz
#define KXG08_WAKE_SLEEP_CTL2_OBTS_100_5 (0x0F << 0)
// Defines control bit polarity for aux2 enable/disable command sequences.
#define KXG08_AUX_I2C_CTL_REG_AUX_CTL_POL2 (0x01 << 5)
// Defines control bit polarity for aux1 enable/disable command sequences.
#define KXG08_AUX_I2C_CTL_REG_AUX_CTL_POL1 (0x01 << 4)
// 100kHz
#define KXG08_AUX_I2C_CTL_REG_AUX_BUS_SPD_100 (0x00 << 3)
// 400kHz
#define KXG08_AUX_I2C_CTL_REG_AUX_BUS_SPD_400 (0x01 << 3)
#define KXG08_AUX_I2C_CTL_REG_AUX_PULL_UP_DISABLED (0x00 << 2)
#define KXG08_AUX_I2C_CTL_REG_AUX_PULL_UP_ENABLED (0x01 << 2)
#define KXG08_AUX_I2C_CTL_REG_AUX_BYPASS (0x01 << 1)
#define KXG08_AUX_I2C_ODR_AUX1_D_0 (0x00 << 4)
#define KXG08_AUX_I2C_ODR_AUX1_D_1 (0x01 << 4)
#define KXG08_AUX_I2C_ODR_AUX1_D_2 (0x02 << 4)
#define KXG08_AUX_I2C_ODR_AUX1_D_3 (0x03 << 4)
#define KXG08_AUX_I2C_ODR_AUX1_D_4 (0x04 << 4)
#define KXG08_AUX_I2C_ODR_AUX1_D_5 (0x05 << 4)
#define KXG08_AUX_I2C_ODR_AUX1_D_6 (0x06 << 4)
#define KXG08_AUX_I2C_ODR_AUX1_D_DNE (0x07 << 4)
// 0.78Hz
#define KXG08_AUX_I2C_ODR_AUX1ODR_0P781 (0x00 << 0)
// 1.563Hz
#define KXG08_AUX_I2C_ODR_AUX1ODR_1P563 (0x01 << 0)
// 3.125Hz
#define KXG08_AUX_I2C_ODR_AUX1ODR_3P125 (0x02 << 0)
// 6.25Hz
#define KXG08_AUX_I2C_ODR_AUX1ODR_6P25 (0x03 << 0)
// 12.5Hz
#define KXG08_AUX_I2C_ODR_AUX1ODR_12P5 (0x04 << 0)
// 25Hz
#define KXG08_AUX_I2C_ODR_AUX1ODR_25 (0x05 << 0)
// 50Hz
#define KXG08_AUX_I2C_ODR_AUX1ODR_50 (0x06 << 0)
// 100Hz
#define KXG08_AUX_I2C_ODR_AUX1ODR_100 (0x07 << 0)
// 200Hz
#define KXG08_AUX_I2C_ODR_AUX1ODR_200 (0x08 << 0)
// 400Hz
#define KXG08_AUX_I2C_ODR_AUX1ODR_400 (0x09 << 0)
// 800Hz
#define KXG08_AUX_I2C_ODR_AUX1ODR_800 (0x0A << 0)
// 1600Hz
#define KXG08_AUX_I2C_ODR_AUX1ODR_1600 (0x0B << 0)
// 1600Hz
#define KXG08_AUX_I2C_ODR_AUX1ODR_1600_1 (0x0C << 0)
// 1600Hz
#define KXG08_AUX_I2C_ODR_AUX1ODR_1600_2 (0x0D << 0)
// 1600Hz
#define KXG08_AUX_I2C_ODR_AUX1ODR_1600_3 (0x0E << 0)
// 1600Hz
#define KXG08_AUX_I2C_ODR_AUX1ODR_1600_4 (0x0F << 0)
#define KXG08_AUX_I2C_ODR2_AUX2_D_0 (0x00 << 4)
#define KXG08_AUX_I2C_ODR2_AUX2_D_1 (0x01 << 4)
#define KXG08_AUX_I2C_ODR2_AUX2_D_2 (0x02 << 4)
#define KXG08_AUX_I2C_ODR2_AUX2_D_3 (0x03 << 4)
#define KXG08_AUX_I2C_ODR2_AUX2_D_4 (0x04 << 4)
#define KXG08_AUX_I2C_ODR2_AUX2_D_5 (0x05 << 4)
#define KXG08_AUX_I2C_ODR2_AUX2_D_6 (0x06 << 4)
#define KXG08_AUX_I2C_ODR2_AUX2_D_DNE (0x07 << 4)
// 0.78Hz
#define KXG08_AUX_I2C_ODR2_AUX2ODR_0P781 (0x00 << 0)
// 1.563Hz
#define KXG08_AUX_I2C_ODR2_AUX2ODR_1P563 (0x01 << 0)
// 3.125Hz
#define KXG08_AUX_I2C_ODR2_AUX2ODR_3P125 (0x02 << 0)
// 6.25Hz
#define KXG08_AUX_I2C_ODR2_AUX2ODR_6P25 (0x03 << 0)
// 12.5Hz
#define KXG08_AUX_I2C_ODR2_AUX2ODR_12P5 (0x04 << 0)
// 25Hz
#define KXG08_AUX_I2C_ODR2_AUX2ODR_25 (0x05 << 0)
// 50Hz
#define KXG08_AUX_I2C_ODR2_AUX2ODR_50 (0x06 << 0)
// 100Hz
#define KXG08_AUX_I2C_ODR2_AUX2ODR_100 (0x07 << 0)
// 200Hz
#define KXG08_AUX_I2C_ODR2_AUX2ODR_200 (0x08 << 0)
// 400Hz
#define KXG08_AUX_I2C_ODR2_AUX2ODR_400 (0x09 << 0)
// 800Hz
#define KXG08_AUX_I2C_ODR2_AUX2ODR_800 (0x0A << 0)
// 1600Hz
#define KXG08_AUX_I2C_ODR2_AUX2ODR_1600 (0x0B << 0)
// 1600Hz
#define KXG08_AUX_I2C_ODR2_AUX2ODR_1600_1 (0x0C << 0)
// 1600Hz
#define KXG08_AUX_I2C_ODR2_AUX2ODR_1600_2 (0x0D << 0)
// 1600Hz
#define KXG08_AUX_I2C_ODR2_AUX2ODR_1600_3 (0x0E << 0)
// 1600Hz
#define KXG08_AUX_I2C_ODR2_AUX2ODR_1600_4 (0x0F << 0)
// 12.5Hz
#define KXG08_TILT_TAP_ODR_OTDT_12P5 (0x00 << 3)
// 25Hz
#define KXG08_TILT_TAP_ODR_OTDT_25 (0x01 << 3)
// 50Hz
#define KXG08_TILT_TAP_ODR_OTDT_50 (0x02 << 3)
// 100Hz
#define KXG08_TILT_TAP_ODR_OTDT_100 (0x03 << 3)
// 200Hz
#define KXG08_TILT_TAP_ODR_OTDT_200 (0x04 << 3)
// 400Hz
#define KXG08_TILT_TAP_ODR_OTDT_400 (0x05 << 3)
// 800Hz
#define KXG08_TILT_TAP_ODR_OTDT_800 (0x06 << 3)
// 1600Hz
#define KXG08_TILT_TAP_ODR_OTDT_1600 (0x07 << 3)
// 1.563Hz
#define KXG08_TILT_TAP_ODR_OTP_1P563 (0x00 << 0)
// 3.125Hz
#define KXG08_TILT_TAP_ODR_OTP_3P125 (0x01 << 0)
// 6.25Hz
#define KXG08_TILT_TAP_ODR_OTP_6P25 (0x02 << 0)
// 12.5Hz
#define KXG08_TILT_TAP_ODR_OTP_12P5 (0x03 << 0)
// 25Hz
#define KXG08_TILT_TAP_ODR_OTP_25 (0x04 << 0)
// 50Hz
#define KXG08_TILT_TAP_ODR_OTP_50 (0x05 << 0)
// 50Hz
#define KXG08_TILT_TAP_ODR_OTP_50_1 (0x06 << 0)
// 50Hz
#define KXG08_TILT_TAP_ODR_OTP_50_2 (0x07 << 0)
// enables/disables the double tap interrupt
#define KXG08_TDTRC_DTRE (0x01 << 1)
// enables/disables single tap interrupt
#define KXG08_TDTRC_STRE (0x01 << 0)
// Free fall engine enable
#define KXG08_FFCTL_FFIE (0x01 << 7)
#define KXG08_FFCTL_ULMODE_LATCHED (0x00 << 6)
#define KXG08_FFCTL_ULMODE_UNLATCHED (0x01 << 6)
// count up/down
#define KXG08_FFCTL_DCRM_UP_DOWN (0x00 << 3)
// count up/reset
#define KXG08_FFCTL_DCRM_UP_RESET (0x01 << 3)
// 12.5Hz
#define KXG08_FFCTL_OFFI_12P5 (0x04 << 0)
// 25Hz
#define KXG08_FFCTL_OFFI_25 (0x05 << 0)
// 50Hz
#define KXG08_FFCTL_OFFI_50 (0x06 << 0)
// 100Hz
#define KXG08_FFCTL_OFFI_100 (0x07 << 0)
// 200Hz
#define KXG08_FFCTL_OFFI_200 (0x08 << 0)
// 400Hz
#define KXG08_FFCTL_OFFI_400 (0x09 << 0)
// 800Hz
#define KXG08_FFCTL_OFFI_800 (0x0A << 0)
// 1600Hz
#define KXG08_FFCTL_OFFI_1600 (0x0B << 0)
// initiates software reset, which performs the RAM reboot routine.
#define KXG08_CTL_REG_1_SRST (0x01 << 7)
// Tilt position engine enable.
#define KXG08_CTL_REG_1_TILT_EN (0x01 << 3)
// Tap/Double Tap engine enable.
#define KXG08_CTL_REG_1_TAP_EN (0x01 << 2)
// Timestamp mode enable.
#define KXG08_CTL_REG_1_CONT_TIME_EN (0x01 << 0)
// Active high I2C disable bit
#define KXG08_STDBY_I2C_DIS (0x01 << 7)
// Temperature sensor is enabled.
#define KXG08_STDBY_TEMP_STDBY_ENABLED (0x00 << 5)
// Temperature sensor is disabled.
#define KXG08_STDBY_TEMP_STDBY_DISABLED (0x01 << 5)
// Aux2 sensor is enabled.
#define KXG08_STDBY_AUX2_STDBY_ENABLED (0x00 << 4)
// Aux2 sensor is disabled.
#define KXG08_STDBY_AUX2_STDBY_DISABLED (0x01 << 4)
// Aux1 sensor is enabled.
#define KXG08_STDBY_AUX1_STDBY_ENABLED (0x00 << 3)
// Aux1 sensor is disabled.
#define KXG08_STDBY_AUX1_STDBY_DISABLED (0x01 << 3)
// Gyro fast start function is disabled.
#define KXG08_STDBY_GYRO_FSTART_DISABLED (0x00 << 2)
// Gyro fast start function is enabled.
#define KXG08_STDBY_GYRO_FSTART_ENABLED (0x01 << 2)
// Gyro sensor is enabled.
#define KXG08_STDBY_GYRO_STDBY_ENABLED (0x00 << 1)
// Gyro sensor is disabled.
#define KXG08_STDBY_GYRO_STDBY_DISABLED (0x01 << 1)
// Accelerometer sensor is enabled.
#define KXG08_STDBY_ACC_STDBY_ENABLED (0x00 << 0)
// Accelerometer sensor is disabled.
#define KXG08_STDBY_ACC_STDBY_DISABLED (0x01 << 0)
#define KXG08_BUF_CTL1_BUF_TEMP (0x01 << 6)
#define KXG08_BUF_CTL1_BUF_ACC_X (0x01 << 5)
#define KXG08_BUF_CTL1_BUF_ACC_Y (0x01 << 4)
#define KXG08_BUF_CTL1_BUF_ACC_Z (0x01 << 3)
#define KXG08_BUF_CTL1_BUF_GYR_X (0x01 << 2)
#define KXG08_BUF_CTL1_BUF_GYR_Y (0x01 << 1)
#define KXG08_BUF_CTL1_BUF_GYR_Z (0x01 << 0)
#define KXG08_BUF_CTL2_BUF_AUX2 (0x01 << 1)
#define KXG08_BUF_CTL2_BUF_AUX1 (0x01 << 0)
// controls activation of the sample buffer.
#define KXG08_BUF_EN_BUFE (0x01 << 7)
// Active high buffer times stamp enable.
#define KXG08_BUF_EN_BUF_TIME_EN (0x01 << 4)
// The buffer collects 4096 bytes of data until full, collecting new data only when the buffer is not full.
#define KXG08_BUF_EN_BUF_M_FIFO (0x00 << 0)
// The buffer holds the last 4096 bytes of data. Once the buffer is full, the oldest data is discarded to make room for newer data.
#define KXG08_BUF_EN_BUF_M_STREAM (0x01 << 0)
// When a trigger event occurs (logic high input on TRIG pin), the buffer holds the last data set of SMP[11:0] samples
#define KXG08_BUF_EN_BUF_M_TRIGGER (0x02 << 0)
#define KXG08_BUF_EN_BUF_M_NOT_VALID (0x03 << 0)
// reports the status of the buffers trigger function if this mode has been selected.
#define KXG08_BUF_STATUS_BUF_TRIG (0x01 << 7)
// WHO_AM_I -value -2080 version
#define KXG08_2080_WHO_AM_I_WIA_ID (0x26 << 0)
// WHO_AM_I -value -1080 version
#define KXG07_1080_WHO_AM_I_WIA_ID (0x29 << 0)
// WHO_AM_I -value -2080 version
#define KXG07_2080_WHO_AM_I_WIA_ID (0x25 << 0)
// WHO_AM_I -value -3001 version
#define KXG07_3001_WHO_AM_I_WIA_ID (0x2F << 0)
 /*registers bit masks */
#define KXG08_BUF_SMPLEV_L_SMP_LEV3_0_MASK 0xF0
#define KXG08_BUF_SMPLEV_H_SMP_LEV11_4_MASK 0xFF
// Detailed aux1 communication status.
#define KXG08_AUX_STATUS_AUX1ST_MASK 0x03
// Detailed aux1 communication status.
#define KXG08_AUX_STATUS_AUX2ST_MASK 0x30

#define KXG08_WHO_AM_I_WIA_MASK 0xFF
// Wake/sleep status flag
#define KXG08_STATUS1_WAKE_SLEEP_MASK 0x04
// Tap/DoubleTap interrupt source.
#define KXG08_INT1_SRC4_INT1_TDTS_MASK 0x06
// Wake/sleep status flag
#define KXG08_STATUS2_WAKE_SLEEP_MASK 0x04

