RohmSemiconductor/RoKiX-firmware-for-nRF5-SDK/firmware/src/rokix/sensors/kxg08/kxg08_registers.h
#define KXG08_INT2_SRC4_INT2_TDTS_MASK 0x06
// Accelerometer OSR control.
#define KXG08_ACCEL_ODR_NAVGA_MASK 0x70

#define KXG08_ACCEL_ODR_ODRA_MASK 0x0F
// Accelerometer bandwidth control.
#define KXG08_ACCEL_CTL_ACC_BW_MASK 0x08
// Accelerometer full scale range select.
#define KXG08_ACCEL_CTL_ACC_FS_MASK 0x03

#define KXG08_GYRO_ODR_NAVGG_MASK 0x70
#define KXG08_GYRO_ODR_ODRG_MASK 0x0F

#define KXG08_GYRO_CTL_GYRO_BW_MASK 0x08

#define KXG08_GYRO_CTL_GYRO_FS_MASK 0x07
// Interrupt polarity select for INT2 pin.
#define KXG08_INT_PIN_CTL_IEA2_MASK 0x40
#define KXG08_INT_PIN_CTL_IEL2_MASK 0x30
// Interrupt polarity select for INT1 pin.
#define KXG08_INT_PIN_CTL_IEA1_MASK 0x04
#define KXG08_INT_PIN_CTL_IEL1_MASK 0x03
// Defines INT2 and SYNC_TRIG pin functionality
#define KXG08_FSYNC_CTL_FSYNC_TRIG_MASK 0x40
// FSYNC enable and mode select.
#define KXG08_FSYNC_CTL_FSYNC_MODE_MASK 0x30

#define KXG08_FSYNC_CTL_FSYNC_SEL_MASK 0x07

#define KXG08_WAKE_SLEEP_CTL1_TH_MODE_MASK 0x20
// Defines de-bounce counter clear mode.
#define KXG08_WAKE_SLEEP_CTL1_C_MODE_MASK 0x10
// sets the Output Data Rate for the Wake-up (motion detection).
#define KXG08_WAKE_SLEEP_CTL1_OWUF_MASK 0x07
// sets the Output Data Rate for the Back to Sleep (BTS).
#define KXG08_WAKE_SLEEP_CTL2_OBTS_MASK 0x0F
// Sets I2C bus speed.
#define KXG08_AUX_I2C_CTL_REG_AUX_BUS_SPD_MASK 0x08
// Active pullup
#define KXG08_AUX_I2C_CTL_REG_AUX_PULL_UP_MASK 0x04
#define KXG08_AUX_I2C_ODR_AUX1_D_MASK 0x70
#define KXG08_AUX_I2C_ODR_AUX1ODR_MASK 0x0F
// Number of bytes read back via Auxiliary I2C bus from device
#define KXG08_AUX_I2C_ODR2_AUX2_D_MASK 0x70
#define KXG08_AUX_I2C_ODR2_AUX2ODR_MASK 0x0F

#define KXG08_TILT_TAP_ODR_OTDT_MASK 0x38

#define KXG08_TILT_TAP_ODR_OTP_MASK 0x07
// Free fall interrupt latch/un-latch control
#define KXG08_FFCTL_ULMODE_MASK 0x40
#define KXG08_FFCTL_DCRM_MASK 0x08

#define KXG08_FFCTL_OFFI_MASK 0x07
// Active low Temperature sensor enable.
#define KXG08_STDBY_TEMP_STDBY_MASK 0x20
// Active low aux2 sensor enable.
#define KXG08_STDBY_AUX2_STDBY_MASK 0x10
// Active low aux1 sensor enable.
#define KXG08_STDBY_AUX1_STDBY_MASK 0x08
// Active high gyroscope fast start sensor enable
#define KXG08_STDBY_GYRO_FSTART_MASK 0x04
// Active low gyroscope sensor enable.
#define KXG08_STDBY_GYRO_STDBY_MASK 0x02
// Active low Accelerometer sensor enable.
#define KXG08_STDBY_ACC_STDBY_MASK 0x01
#define KXG08_BUF_WMITH_L_SMP_TH13_0_MASK 0xF0
#define KXG08_BUF_WMITH_H_SMP_TH11_4_MASK 0xFF
#define KXG08_BUF_TRIGTH_L_TRIG_TH3_0_MASK 0xF0
#define KXG08_BUF_TRIGTH_H_TRIG_TH11_4_MASK 0xFF
// selects the operating mode of the sample buffer
#define KXG08_BUF_EN_BUF_M_MASK 0x03

#define KXG08_2080_WHO_AM_I_WIA_MASK 0xFF

#define KXG07_1080_WHO_AM_I_WIA_MASK 0xFF

#define KXG07_2080_WHO_AM_I_WIA_MASK 0xFF

#define KXG07_3001_WHO_AM_I_WIA_MASK 0xFF
#endif

